---
kind: method
id: M:Autodesk.Revit.DB.Electrical.InsulationTypeSet.#ctor
source: html/74281022-efdb-330f-a785-41ef8c76ed64.htm
---
# Autodesk.Revit.DB.Electrical.InsulationTypeSet.#ctor Method

Initializes a new instance of the InsulationTypeSet class

## Syntax (C#)
```csharp
public InsulationTypeSet()
```